Tekla.Structures.PluginsInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.PluginsInternal.DelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.PluginsInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.PluginsInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: